publish/opam-compilation-cache.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-03-03 Sun 07:24 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Compilation cache in opam</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Louis Roché">
<meta name="description" content="How to enable compilation cache in opam to enjoy fast re-installation"
>
<meta name="keywords" content="OCaml,opam,cache">
<link rel="stylesheet" href="/org.css" type="text/css"></head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="archive.html"> HOME </a>
</div><div id="content">
<header>
<h1 class="title">Compilation cache in opam</h1>
</header><p>
There is some <a href="https://github.com/ocaml/opam/issues/629#issuecomment-352042373">work going on</a> opam to add support for compilation
cache. Compilation cache means instantaneous re-installation of
packages that have been already installed previously, even if it was
in another switch. It is a very convenient feature when working with
local switches, git worktree and lock files.
</p>

<p>
If each git branch is in its own directory with its own opam switch,
it might be very long to create a switch for each branch. It is
possible to use <code>opam switch link</code> to reduce the number of actual
switches. But it doesn't work when the branches are using different
versions of the same packages.
</p>

<p>
Also there are some tools like utop, merlin, ocp-indent, ocp-index,
that we want to install in basically every switch. And we don't want
to spend a long time waiting for them to get compiled.
</p>

<p>
Those are situations where compilation cache shines. As long as a
package has been installed once, installing it again is basically a
no-op.
</p>

<p>
To enable the cache, we need to download this file:
<a href="https://github.com/ocaml/opam/blob/4756ca1/shell/opam-bin-cache.sh">opam-bin-cache.sh</a>. And to to make it executable.
</p>

<p>
The <code>sandbox.sh</code> hook is stored by opam in
<code>$HOME/.opam/opam-init/hooks</code>. <code>opam-bin-cache.sh</code> can be moved there
too.
</p>

<div class="org-src-container">
<pre class="src src-bash">curl <span class="org-string">"https://raw.githubusercontent.com/ocaml/opam/4756ca1870d65130d5b909309c2041ce05b06a4e/shell/opam-bin-cache.sh"</span> -O
chmod +x opam-bin-cache.sh
mv opam-bin-cache.sh $<span class="org-variable-name">HOME</span>/.opam/opam-init/hooks/
</pre>
</div>

<p>
Then the opam configuration file has to be modified. At the end of the
configuration, there are 3 wrap commands using <code>sandbox.sh</code>. It looks
like this:
</p>

<div class="org-src-container">
<pre class="src src-conf">wrap-build-commands:
 [<span class="org-string">"%{hooks}%/sandbox.sh"</span> <span class="org-string">"build"</span>] {os = <span class="org-string">"linux"</span> | os = <span class="org-string">"macos"</span>}
wrap-install-commands:
 [<span class="org-string">"%{hooks}%/sandbox.sh"</span> <span class="org-string">"install"</span>] {os = <span class="org-string">"linux"</span> | os = <span class="org-string">"macos"</span>}
wrap-remove-commands:
 [<span class="org-string">"%{hooks}%/sandbox.sh"</span> <span class="org-string">"remove"</span>] {os = <span class="org-string">"linux"</span> | os = <span class="org-string">"macos"</span>}
</pre>
</div>

<p>
Those lines must be replaced by:
</p>

<div class="org-src-container">
<pre class="src src-conf">pre-install-commands:
  [<span class="org-string">"%{hooks}%/opam-bin-cache.sh"</span> <span class="org-string">"restore"</span> build-id name] {?build-id}
wrap-build-commands: [
  [<span class="org-string">"%{hooks}%/opam-bin-cache.sh"</span> <span class="org-string">"wrap"</span> build-id] {?build-id}
  [<span class="org-string">"%{hooks}%/sandbox.sh"</span> <span class="org-string">"build"</span>] {os = <span class="org-string">"linux"</span>}
]
wrap-install-commands: [
  [<span class="org-string">"%{hooks}%/opam-bin-cache.sh"</span> <span class="org-string">"wrap"</span> build-id] {?build-id}
  [<span class="org-string">"%{hooks}%/sandbox.sh"</span> <span class="org-string">"install"</span>] {os = <span class="org-string">"linux"</span>}
]
wrap-remove-commands: [<span class="org-string">"%{hooks}%/sandbox.sh"</span> <span class="org-string">"remove"</span>] {os = <span class="org-string">"linux"</span>}
post-install-commands:
  [<span class="org-string">"%{hooks}%/opam-bin-cache.sh"</span> <span class="org-string">"store"</span> build-id installed-files]
    <span class="org-variable-name">{?build-id &amp; error-code</span> = <span class="org-string">"0"</span>}
</pre>
</div>

<p>
For people using multiple ocaml root, another solution is to put
<code>opam-bin-cache.sh</code> in the <code>PATH</code>, and to modify <code>$HOME/.opam/config</code>
this way:
</p>

<div class="org-src-container">
<pre class="src src-conf">pre-install-commands:
  [<span class="org-string">"opam-bin-cache.sh"</span> <span class="org-string">"restore"</span> build-id name] {?build-id}
wrap-build-commands: [
  [<span class="org-string">"opam-bin-cache.sh"</span> <span class="org-string">"wrap"</span> build-id] {?build-id}
  [<span class="org-string">"%{hooks}%/sandbox.sh"</span> <span class="org-string">"build"</span>] {os = <span class="org-string">"linux"</span>}
]
wrap-install-commands: [
  [<span class="org-string">"opam-bin-cache.sh"</span> <span class="org-string">"wrap"</span> build-id] {?build-id}
  [<span class="org-string">"%{hooks}%/sandbox.sh"</span> <span class="org-string">"install"</span>] {os = <span class="org-string">"linux"</span>}
]
wrap-remove-commands: [<span class="org-string">"%{hooks}%/sandbox.sh"</span> <span class="org-string">"remove"</span>] {os = <span class="org-string">"linux"</span>}
post-install-commands:
  [<span class="org-string">"opam-bin-cache.sh"</span> <span class="org-string">"store"</span> build-id installed-files]
    <span class="org-variable-name">{?build-id &amp; error-code</span> = <span class="org-string">"0"</span>}
</pre>
</div>

<p>
Let's see how it works.
</p>

<div class="org-src-container">
<pre class="src src-bash">mkdir /tmp/demo<span class="org-rainbow-delimiters-depth-1">{</span>1,2<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-builtin">cd</span> /tmp/demo1
opam switch create . --empty
opam install ocaml-base-compiler.4.06.1 merlin utop core <span class="org-comment-delimiter"># </span><span class="org-comment">takes 5 minutes</span>
<span class="org-builtin">cd</span> /tmp/demo2
opam switch create . --empty
opam install ocaml-base-compiler.4.06.1 merlin utop core <span class="org-comment-delimiter"># </span><span class="org-comment">takes 10 seconds</span>
</pre>
</div>

<p>
I hope this setting can push people to use more local switches and
avoid some of the confusion coming with global switches.
</p>

<p>
Please note that this is still experimental. There are some issues
with <code>ocamlfind</code> that are documented <a href="https://github.com/ocaml/opam-repository/issues/10863">here</a>.
</p>

<p>
<code>esy</code>, another cli tool to get opam packages, also provides
compilation cache. They <a href="https://discordapp.com/channels/235176658175262720/235200837608144898/481805082967408640">claimed to have solve those problems</a>.
</p>

<blockquote>
<p>
andreypopp : @Khady in esy findlib.conf only contains a single entry which points to ocamlfind itself, then esy constructs $OCAMLPATH which includes all packages in a sandbox
</p>

<p>
andreypopp : we also have custom build steps for ocamlfind which re-create $OCAMLLIB inside ocamlfind so that ocamlfind can put topfind in there (this is needed b/c some pacages like to see topfind inside $OCAMLLIB).
</p>

<p>
andreypopp : details: <a href="https://github.com/esy-ocaml/esy-opam-override/blob/6/packages/ocamlfind.%3C1.7.0/files/_esy/build">https://github.com/esy-ocaml/esy-opam-override/blob/6/packages/ocamlfind.<1.7.0/files/_esy/build</a>
</p>
</blockquote>
</div>
<div id="postamble" class="status">
<a class="author" href="https://khady.info">Louis Roché</a> <span class="date">2018-08-23 Thu 00:00</span>
          <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="https://orgmode.org">Org</a> mode 9.2.1)</span>
</div>
</body>
</html>
